Repository: wadchathuranga/banana_digital
Catalog: lib/l10n/app_*.arb
Languages: si

# language
source: En
si: සිං

source: Required
si: අවශ්‍යයි

# formTitle
source: Fill the following questionnaire
si: පහත දත්ත පුරවන්න

# q1name
source: Variety
si: වර්ගය

# q1desc
source: The type of banana variety being grown (e.g. Cavendish, Williams, etc.)
si: වගා කරන කෙසෙල් වර්ගය

# selectLanguage
source: Choose a language
si: භාෂාව තෝරන්න

# commonMsg
source: How can I help you..?
si: ඔබට උදව් කරන්නේ කෙසේ ද?

# dropdown
source: Select your choice
si: ඔබේ තේරීම තෝරන්න

# clear
source: Clear Form
si: දත්ත ඉවත් කරන්න

# identifyDisease
source: Identify the Disease
si: රෝගය හඳුනා ගන්න

# identifyDiseaseTabName
source: Diseases Identification
si: රෝග හඳුනා ගැනීම

# chatTabName
source: Chat
si: කතාබස් කිරීම

source: Leaf Color
si: පත්‍ර වර්ණය

source: Leaf Spots
si: පත්‍ර පැල්ලම් වර්ණය

source: Leaf Curling
si: පත්‍ර රෝල් වීම

source: Leaf Wilting
si: පත්‍ර මැලවීම

source: Stem Color
si: කඳේ වර්ණය

source: Root Rot
si: මූලය කුණු වීම

source: Abnormal Fruiting
si: අසාමාන්‍යය ගෙඩි

source: Presence of Pets
si: කෘමි සතුන් සිටීම

source: Stunted Growth
si: වර්ධනය අඩාල වීම

source: Yellow
si: කහ පැහැති

source: Brown
si: දුඹුරු පැහැති

source: Pale Green
si: ලා කොළ පැහැති

source: Dark Green
si: තද කොළ පැහැති

source: Black
si: කළු පැහැති

source: Green
si: කොළ පැහැති

source: Red
si: රතු පැහැති

source: None
si: කිසිවක් නැත

source: Yes
si: ඔව්

source: No
si: නැත

source: Normal
si: සමාන්‍යයයි

source: Slow
si: මන්දගාමී

source: Distorted
si: විකෘති වී ඇත

source: Aphids
si: කුඩිත්තන්

source: Caterpillars
si: දළඹුවන්

source: Mites
si: මයිටාවන්
